---
type: AdaptiveComponentInstanceUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# AdaptiveComponentInstanceUtils

`Autodesk.Revit.DB.AdaptiveComponentInstanceUtils` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateAdaptiveComponentInstance | 2012 | `public static FamilyInstance CreateAdaptiveComponentInstance ( Document doc , FamilySymbol famSymb )` |
| Method | GetInstancePlacementPointElementRefIds | 2012 | `public static IList < ElementId > GetInstancePlacementPointElementRefIds ( FamilyInstance famInst )` |
| Method | GetInstancePointElementRefIds | 2012 | `public static IList < ElementId > GetInstancePointElementRefIds ( FamilyInstance famInst )` |
| Method | GetInstanceShapeHandlePointElementRefIds | 2012 | `public static IList < ElementId > GetInstanceShapeHandlePointElementRefIds ( FamilyInstance famInst )` |
| Method | HasAdaptiveFamilySymbol | 2012 | `public static bool HasAdaptiveFamilySymbol ( FamilyInstance famInst )` |
| Method | IsAdaptiveComponentInstance | 2012 | `public static bool IsAdaptiveComponentInstance ( FamilyInstance famInst )` |
| Method | IsAdaptiveFamilySymbol | 2012 | `public static bool IsAdaptiveFamilySymbol ( FamilySymbol famSymb )` |
| Method | IsInstanceFlipped | 2012 | `public static bool IsInstanceFlipped ( FamilyInstance famInst )` |
| Method | MoveAdaptiveComponentInstance | 2012 | `public static void MoveAdaptiveComponentInstance ( FamilyInstance famInst , Transform trf , bool unHost )` |
| Method | SetInstanceFlipped | 2012 | `public static void SetInstanceFlipped ( FamilyInstance famInst , bool flip )` |